letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']

dct = dict(zip(letters, morse))  # соединили буквы (ключи) и азбуку (значения) в словарь

message = []
for i in input():
    message.extend(i.upper().strip(' .,!?;"-=+&@'))

for i in message:
    print(dct[i], '', end='')